/**
 * locale ru
 */
$.extend($.idealforms.errors, {

    required: 'Это поле обязательно.',
    number: 'Введите число.',
    digits: 'Это поле может содержать только цифры.',
    name: 'Может содержать только буквы и быть длиной как минимум 3 символа.',
    username: 'Должен быть длиной от 4 до 32 символов и начинаться с буквы. Вы можете использовать буквы, цифры, символ подчеркивания и одну точку (.)',
    pass: 'Должен быть как минимум 6 символов, содержать минимум одну цифру, одну заглавную и одну прописную буквы.',
    strongpass: 'Должен быть как минимум 8 символов, содержать минимум, одну заглавную, одну прописную буквы и одну цифру или специальный символ.',
    email: 'Введите корректный email адрес. <em>(например, user@gmail.com)</em>',
    phone: 'Введите корректный телефонный номер США. <em>(например, 555-123-4567)</em>',
    zip: 'Введите корректный почтовый индекс США. <em>(например, 33245 or 33245-0003)</em>',
    url: 'Введите корректный интернет-адрес. <em>(например, www.google.com)</em>',
    minChar: 'Должено содержать как минимум <strong>{0}</strong> символов.',
    minOption: 'Выберите как минимум <strong>{0}</strong> варианта.',
    maxChar: 'Не может быть длиннее <strong>{0}</strong> символов.',
    maxOption: 'Вы не можете выбрать больше <strong>{0}</strong> вариантов.',
    range: 'Введите цифру в диапазоне между {0} и {1}.',
    date: 'Введите корректную дату. <em>(например, {0})</em>',
    dob: 'Введите корректную дату рождения.',
    exclude: '"{0}" не доступно.',
    excludeOption: '{0}',
    equalto: 'Должно совпадать с <strong>"{0}"</strong>',
    extension: 'Выберите разрешенное расширение файла. <em>(например, "{0}")</em>',
    ajaxSuccess: '<strong>{0}</strong> не доступно.',
    ajaxError: 'Ошибка сервера...'

})
